# ======= Valida\u00E7\u00E3o de Arquivo =======
file.upload.empty=N\u00E3o \u00E9 poss\u00EDvel carregar um arquivo vazio.
file.upload.large=O tamanho do arquivo excede o limite permitido: %s.
file.upload.invalid_type=Somente tipos de imagem JPEG e PNG s\u00E3o permitidos para esta opera\u00E7\u00E3o.
file.profile_image.large=O tamanho da imagem de perfil excede o limite de 5 MB: %s.
file.profile_image.invalid_type=Somente tipos de imagem JPEG e PNG s\u00E3o permitidos para fotos de perfil.
profile.not_found=O perfil com o ID fornecido n\u00E3o foi encontrado.
profile.image.not_found=A imagem de perfil com o ID fornecido n\u00E3o foi encontrada.
profile.image.conflict=A imagem de perfil com o ID fornecido n\u00E3o corresponde ao usu\u00E1rio associado a ela.
profile.image.not.set=A imagem de perfil n\u00E3o foi definida para o usu\u00E1rio.

# ======= Activity Validation =======
activity.title.not.blank=O t\u00EDtulo da atividade n\u00E3o pode estar em branco.
activity.description.not.blank=A descri\u00E7\u00E3o da atividade n\u00E3o pode estar em branco.
activity.activity_type.not.null=Um tipo de atividade deve ser selecionado.
activity.recommended_level.min=O n\u00EDvel recomendado deve ser maior ou igual a 1.
activity.difficulty_level.range=O n\u00EDvel de dificuldade deve estar entre 1 e 3.
activity.max_score.min=O valor m\u00E1ximo de pontos deve ser maior que 0.0.
activity.max_score.not.null=Defina um valor m\u00E1ximo de pontos.
activity.deadline.future_or_present=O prazo deve representar uma data futura.
activity.subject.not.blank=O c\u00F3digo da disciplina n\u00E3o pode estar em branco.
activity.link.description.size=A descri\u00E7\u00E3o do link deve ter no m\u00E1ximo 500 caracteres.
error.file.id.invalid=Que idiota usaria um n\u00E3o n\u00FAmero ou negativo para um campo que espera um ID numerico???

# ======= Activity Errors =======
error.size.invalid=O par\u00E2metro size deve estar entre 1 e 50.
error.page.invalid=O par\u00E2metro page deve ser maior ou igual a 0.
error.activity.duplicate=A atividade com o t\u00EDtulo fornecido j\u00E1 existe.
error.activity.not.found=A atividade com o ID fornecido n\u00E3o foi encontrada.
error.activity.id.invalid=O ID deve pertencer ao conjunto dos inteiros.
error.file.not.found=O arquivo com o ID fornecido n\u00E3o foi encontrado.

# ======= Activity Conflicts =======
conflict.activity.completed=N\u00E3o \u00E9 poss\u00EDvel editar uma atividade j\u00E1 finalizada.
conflict.activity.id.unexpected=O ID da atividade n\u00E3o corresponde ao ID fornecido na URL.

# ======= User Validation =======
user.username.not.blank=O nome de usu\u00E1rio n\u00E3o pode estar em branco.
user.username.size=O nome de usu\u00E1rio deve ter entre 3 e 50 caracteres.
user.username.pattern=O nome de usu\u00E1rio deve come\u00E7ar com uma letra e pode conter letras, n\u00FAmeros, sublinhados e h\u00EDfens.
user.password.not.blank=A senha n\u00E3o pode estar em branco.
user.current.password.not.blank=A senha atual n\u00E3o pode estar em branco.
user.new.password.not.blank=A nova senha n\u00E3o pode estar em branco.
user.password.size=A senha deve ter pelo menos 6 caracteres.
user.password.pattern.uppercase=A senha deve conter pelo menos uma letra mai\u00FAscula.
user.password.pattern.lowercase=A senha deve conter pelo menos uma letra min\u00FAscula.
user.password.pattern.digit=A senha deve conter pelo menos um d\u00EDgito.
user.password.pattern.special=A senha deve conter pelo menos um caractere especial.
user.email.format=A formata\u00E7\u00E3o do e-mail \u00E9 inv\u00E1lida.
user.role.not.null=Um papel de usu\u00E1rio deve ser selecionado.
tutor.start_date.not.null=A data de in\u00EDcio do tutor n\u00E3o pode ser nula.
tutor.user.not.null=O usu\u00E1rio associado ao tutor n\u00E3o pode ser nulo.
user.tutorings.not.empty=O usu\u00E1rio deve ter pelo menos uma tutoria associado a ele.

# ======= Profile Validation =======
profile.name.size=O nome deve ter entre 1 e 100 caracteres.
profile.phone.pattern=O n\u00FAmero de telefone deve estar no formato <ddd><n\u00FAmero> (ex: 12934567890).
profile.total_score.min=A pontua\u00E7\u00E3o total deve ser pelo menos 0.
profile.level.min=O n\u00EDvel deve ser pelo menos 1.
profile.bio.size=A biografia deve ter entre 0 e 150 caracteres.

# ======== Tutor Validation =========
tutor.exists.conflict=Voc\u00EA n\u00E3o pode criar um tutor com o mesmo usu\u00E1rio mais de uma vez.
tutor.empty.file=O arquivo do arquivo do tutor n\u00E3o pode estar vazio.
tutor.file.too.large=O tamanho do arquivo do tutor deve ser de no m\u00E1ximo 5 MB.
tutor.file.invalid_type=Somente tipos de arquivo PDF e DOCX s\u00E3o permitidos.
tutor.error.file.upload=Ocorreu um erro ao fazer o upload do arquivo do tutor.

# ======= Tutoring Validation =======
tutoring.description.size=A descri\u00E7\u00E3o do tutoria deve ter at\u00E9 150 caracteres.
tutoring.urlThumbnail.size=A URL da thumbnail do tutoria deve ter at\u00E9 1000 caracteres.
tutoring.urlThumbnail.format=A URL da thumbnail deve ser uma URL v\u00E1lida.
tutoring.location.size=O local do tutoria deve ter at\u00E9 50 caracteres.
tutoring.vacancies.min=O n\u00FAmero de vagas deve ser pelo menos 1.
tutoring.mode.compliant=O modo de tutoria deve ser 'ONLINE', 'PRESENCIAL' ou 'H\u00CDBRIDO'.
tutoring.is_active.not_null=O campo 'is_active' n\u00E3o pode ser nulo.

# ======= Auth Validation =======
auth.refresh_token.not.null=O token de atualiza\u00E7\u00E3o n\u00E3o pode ser nulo.

# ======= Subject Validation =======
error.subject.not.found=A disciplina com o c\u00F3digo fornecido n\u00E3o foi encontrada.
error.subject.inactive=A disciplina est\u00E1 inativa.